tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/cask-drivers"

# =============================================================================
# CLI Tools
# =============================================================================

## Package Manager
brew "mas"

## Shell Enhancement
brew "zsh-completions"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "zsh-git-prompt"
brew "starship"

## Development Tools
# brewでgitをインストールする事により
# zsh-completion用のgitの設定ファイルを/usr/local/share/zsh/site-functions以下に置く
# https://www.setoya-blog.com/entry/2020/06/11/115558
brew "git"
brew "gh"
brew "jq"

## Utilities
brew "trash-cli"
brew "unzip"

# =============================================================================
# Web Browsers
# =============================================================================
cask "firefox"
cask "microsoft-edge"
cask "google-chrome"

# =============================================================================
# Communication & Collaboration
# =============================================================================
cask "slack"
cask "zoom"
cask "discord"
cask "notion"
cask "evernote"

# =============================================================================
# Development Environment
# =============================================================================

## Editors & IDEs
cask "visual-studio-code"
cask "cursor"
cask "intellij-idea"
cask "webstorm"
cask "jetbrains-toolbox"

## Terminals
cask "ghostty"

## Containers & Cloud
cask "docker"
cask "google-cloud-sdk"

## AI Tools
cask "chatgpt"

# =============================================================================
# Database Tools
# =============================================================================
cask "dbeaver-community"
cask "tableplus"

# =============================================================================
# Media
# =============================================================================
cask "vlc"
cask "shotcut"
cask "kindle"

# =============================================================================
# Translation
# =============================================================================
cask "deepl"
cask "nani"

# =============================================================================
# Utilities
# =============================================================================
cask "alfred"
cask "karabiner-elements"
cask "cheatsheet"
cask "dropbox"
cask "tailscale-app"
cask "balenaetcher"
cask "elgato-stream-deck"
cask "google-japanese-ime"

## Security Tools
cask "zap"

## Microsoft
cask "microsoft-auto-update"
cask "microsoft-office"

## Manual Installation Required
# .appファイルのインストールのため、手動でインストールすること
# cask "logi-options-plus"

# =============================================================================
# Development - Client Side
# =============================================================================
brew "volta"
brew "uv"

# =============================================================================
# Mac App Store
# =============================================================================
mas "LINE", id: 539883307
mas "Yoink", id: 457622435
